app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT `tasks`.* FROM `tasks`

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO `tasks` (`content`, `created_at`, `updated_at`) VALUES ('Some Task', '2014-11-30 06:53:10', '2014-11-30 06:53:10')